### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_cloudtrail.this will be created
+   resource "aws_cloudtrail" "this" {
+       arn                           = (known after apply)
+       enable_log_file_validation    = false
+       enable_logging                = true
+       home_region                   = (known after apply)
+       id                            = (known after apply)
+       include_global_service_events = true
+       is_multi_region_trail         = true
+       is_organization_trail         = false
+       name                          = "kiririmode-trail"
+       s3_bucket_name                = (known after apply)
+       s3_key_prefix                 = "prefix"
+       tags_all                      = {
+           "ManagedBy" = "Terraformer"
        }
    }

  # aws_s3_bucket.trail will be created
+   resource "aws_s3_bucket" "trail" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = "kiririmode-trail-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Name" = "S3 Trail Bucket"
        }
+       tags_all                    = {
+           "ManagedBy" = "Terraformer"
+           "Name"      = "S3 Trail Bucket"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       object_lock_configuration {
+           object_lock_enabled = "Enabled"
        }

+       server_side_encryption_configuration {
+           rule {
+               apply_server_side_encryption_by_default {
+                   sse_algorithm = "AES256"
                }
            }
        }

+       versioning {
+           enabled    = true
+           mfa_delete = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>